package src.domain;

// ============================================================
// Інтерфейс консольної команди - розширює Command
// ============================================================

/**
 * <h1>ConsoleCommand</h1>
 *
 * Розширює {@link Command} — додає гарячу клавішу
 * та текстовий опис для виводу в меню.
 */
public interface ConsoleCommand extends Command {

    /**
     * Повертає символ гарячої клавіші команди.
     * @return символ клавіші
     */
    char getKey();
}