package src.domain;

// ============================================================
// ЗАВДАННЯ 5 - інтерфейс для "фабрикуючого" методу
// ============================================================

/**
 * <h1>Viewable</h1>
 *
 * Інтерфейс Creator у шаблоні Factory Method.
 * Оголошує метод, що "фабрикує" об'єкти типу {@link View}.
 */
public interface Viewable {

    /**
     * Створює об'єкт, що реалізує інтерфейс {@link View}.
     * @return новий об'єкт View
     */
    View getView();
}